RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_can.h
/**
 *******************************************************************************
 * @file  hc32f4a0_can.h
 * @brief This file contains all the functions prototypes of the CAN driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
   2020-12-14       Wuze            Modified comment of structure stc_can_bt_cfg_t
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_CAN_H__
#define __HC32F4A0_CAN_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_CAN
 * @{
 */

#if (DDL_CAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup CAN_Global_Types CAN Global Types
 * @{
 */

/**
 * @brief CAN bit timing configuration structure. See 11898-1 for details.
 * @note 1. Restrictions: u32SEG1 >= u32SEG2 + 1, u32SEG2 >= u32SJW.
 * @note 2. TQ = u32Prescaler / CANClock.
 * @note 3. Bit time = (u32SEG2 + u32SEG2) x TQ.
 * @note 4. Baudrate = CANClock/(u32Prescaler*(u32SEG1 + u32SEG2))
 */
typedef struct
{
    uint32_t u32SEG1;                       /*!< TQs of segment 1. Contains synchronization segment, \
                                                 propagation time segment and phase buffer segment 1. */
    uint32_t u32SEG2;                       /*!< TQs of segment 2. Phase buffer segment 2. */
    uint32_t u32SJW;                        /*!< TQs of synchronization jump width. */
    uint32_t u32Prescaler;                  /*!< Range [1, 256]. */
} stc_can_bt_cfg_t;

/**
 * @brief CAN acceptance filter structure.
 */
typedef struct
{
    uint32_t u32ID;                         /*!< 11 bits standard ID or 29 bits extended ID, depending on IDE. */
    uint32_t u32IDMsk;                      /*!< ID mask. The mask bits of ID will be ignored by the acceptance filter. */
    uint32_t u32MskType;                    /*!< Acceptance filter mask type. This parameter can be a value of @ref CAN_AF_Mask_Type */
} stc_can_af_cfg_t;

/**
 * @brief CAN FD configuration structure.
 */
typedef struct
{
    uint8_t u8CANFDMode;                    /*!< CAN-FD mode, Bosch CAN-FD or 11898-1:2015 CAN-FD.
                                                 This parameter can be a value of @ref CAN_FD_Mode */
    stc_can_bt_cfg_t stcFBT;                /*!< Bit timing configuration of fast bit timing. */
    uint8_t u8TDCCmd;                       /*!< Transmiter delay compensation function control.
                                                 This parameter can be a value of @ref CAN_FD_TDC_Command */
    uint8_t u8TDCSSP;                       /*!< Specify secondary sample point(SSP) of transmitter delay compensatin(TDC). Number of TQ. */
} stc_can_fd_cfg_t;

/**
 * @brief CAN time-triggered communication configuration structure.
 */
typedef struct
{
    uint8_t u8TransBufMode;                 /*!< TTCAN Transmit Buffer Mode.
                                                 This parameter can be a value of @ref CAN_TTC_Transmit_Buffer_Mode */
    uint8_t u8NTUPrescaler;                 /*!< Prescaler of NTU(network time unit). The source is the bit time which is defined by SBT.
                                                 This parameter can be a value of @ref CAN_TTC_NTU_Prescaler */
    uint32_t u32RefMsgIDE;                  /*!< Reference message identifier extension bit.
                                                 '1' to set the ID which is specified by parameter 'u32RefMsgID' as an extended ID while \
                                                 '0' to set it as a standard ID. */
    uint32_t u32RefMsgID;                   /*!< Reference message identifier. */
    uint16_t u16TrigType;                   /*!< Trigger type of TTC.
                                                 This parameter can be a value of @ref CAN_TTC_Trigger_Type */
    uint16_t u16TxEnWindow;                 /*!< Tx_Enable window. Time period within which the transmission of a message may be started. Range is [1, 16U] */
    uint16_t u16TxTrigTime;                 /*!< Specifies for the referred message the time window of the matrix cycle at which it is to be transmitted. */
    uint16_t u16WatchTrigTime;              /*!< Time mark used to check whether the time since the last valid reference message has been too long. */
} stc_can_ttc_cfg_t;

/**
 * @brief CAN initialization structure.
 */
typedef struct
{
    uint8_t u8WorkMode;                     /*!< Specify the work mode of CAN.
                                                 This parameter can be a value of @ref CAN_Work_Mode */
    stc_can_bt_cfg_t stcSBT;                /*!< Bit timing configuration of slow bit timing. */

    en_functional_state_t enCANFDCmd;       /*!< Enable or Disable CAN-FD. If Disable, the following configuration valuse will not \
                                                 be written to the registers. */

    stc_can_fd_cfg_t stcFDCfg;              /*!< CAN-FD configuration structure. */

    uint8_t u8TransMode;                    /*!< Transmission mode of PTB and STB.
                                                 This parameter can be a value of @ref CAN_Trans_Mode */
    uint8_t u8STBPrioMode;                  /*!< Priority mode of STB. First in first transmit. OR the priority is determined by ID. Smaller ID higher priority.
                                                 Whatever the priority mode of STB is, PTB always has the highest priority.
                                                 This parameter can be a value of @ref CAN_STB_Priority_Mode */
    uint8_t u8RBSWarnLimit;                 /*!< Specify receive buffer almost full warning limit. Rang is [1, 8]. \
                                                 Each CAN unit has 8 receive buffer slots. When the number of received frames reaches \
                                                 the set value of u8RBSWarnLimit, register bit RTIF.RAFIF is set and the interrupt occurred \
                                                 if it was enabled. */
    uint8_t u8ErrWarnLimit;                 /*!< Specify programmable error warning limit. Range is [0, 15]. \
                                                 Error warning limit = (u8ErrWarnLimit + 1) * 8. */
    stc_can_af_cfg_t *pstcAFCfg;            /*!< Points to a stc_can_af_cfg_t structure type pointer value that
                                                 contains the configuration informations for the acceptance filters. */
    uint16_t u16AFSel;                      /*!< Specify acceptance filter for receive buffer.
                                                 This parameter can be values of @ref CAN_AF */
    uint8_t u8RBStoreSel;                   /*!< Receive buffer stores all data frames, includes error data.
                                                 This parameter can be a value of @ref CAN_RB_Store_Selection */
    uint8_t u8RBOvfOp;                      /*!< Operation when receive buffer overflow.
                                                 This parameter can be a value of @ref CAN_RB_Overflow_Operation */
    uint8_t u8SelfACKCmd;                   /*!< Self ACK. Only for external loopback mode.
                                                 This parameter can be a value of @ref CAN_Self_ACK_Command */
} stc_can_init_t;

/**
 * @brief CAN transmit data structure.
 */
typedef struct
{
    uint32_t u32ID;                         /*!< 11 bits standard ID or 29 bits extended ID, depending on IDE. */
    union
    {
        uint32_t u32Ctrl;
        struct
        {
            uint32_t DLC: 4;                /*!< Data length code. Length of the data segment of data frame. \
                                                 It should be zero while the frame is remote frame. \
                                                 This parameter can be a value of @ref CAN_DLC */
            uint32_t BRS: 1;                /*!< Bit rate switch. */
            uint32_t FDF: 1;                /*!< CAN FD frame. */
            uint32_t RTR: 1;                /*!< Remote transmission request bit.
                                                 It is used to distinguish between data frames and remote frames. */
            uint32_t IDE: 1;                /*!< Identifier extension flag.
                                                 It is used to distinguish between standard format and extended format.
                                                 This parameter can be a 1 or 0. */
            uint32_t RSVD: 24;              /*!< Reserved bits. */
        };
    };
    uint8_t *pu8Data;                      /*!< Pointer to data filed of data frame. */
} stc_can_tx_t;

/**
 * @brief CAN receive data structure.
 */
typedef struct
{
    uint32_t u32ID;                         /*!< 11 bits standard ID or 29 bits extended ID, depending on IDE. */
    union
    {
        uint32_t u32Ctrl;
        struct
        {
            uint32_t DLC: 4;                /*!< Data length code. Length of the data segment of data frame. \
                                                 It should be zero while the frame is remote frame. \
                                                 This parameter can be a value of @ref CAN_DLC */
            uint32_t BRS: 1;                /*!< Bit rate switch. */
            uint32_t FDF: 1;                /*!< CAN FD frame. */
            uint32_t RTR: 1;                /*!< Remote transmission request bit.
                                                 It is used to distinguish between data frames and remote frames. */
            uint32_t IDE: 1;                /*!< Identifier extension flag.
                                                 It is used to distinguish between standard format and extended format.
                                                 This parameter can be 1 or 0. */
            uint32_t RSVD: 4;               /*!< Reserved bits. */
            uint32_t TX: 1;                 /*!< This bit is set to 1 when receiving self-transmitted data in loopback mode. */
            uint32_t ERRT: 3;               /*!< Error type. */
            uint32_t CYCLE_TIME: 16;        /*!< Cycle time of time-triggered communication(TTC). */
        };
    };
    uint8_t *pu8Data;                       /*!< Pointer to data filed of data frame. */
} stc_can_rx_t;

/**
 * @}
 */

