RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_can.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CAN_Global_Macros CAN Global Macros
 * @{
 */

/**
 * @defgroup CAN_Work_Mode CAN Work Mode
 * @{
 */
#define CAN_MODE_NORMAL                 (0U)                    /*!< Normal work mode. */
#define CAN_MODE_SILENT                 (1U)                    /*!< Silent work mode. Prohibit data transmission. */
#define CAN_MODE_ILB                    (2U)                    /*!< Internal loopback mode, just for self-test while developing. */
#define CAN_MODE_ELB                    (3U)                    /*!< External loopback mode, just for self-test while developing. */
#define CAN_MODE_ELB_SILENT             (4U)                    /*!< External loppback silent mode, just for self-test while developing. \
                                                                     It is forbidden to respond to received frames and error frames, but data can be transmitted. */
/**
 * @}
 */

/**
 * @defgroup CAN_Transmit_Buffer_Type CAN Transmit Buffer Type
 * @{
 */
#define CAN_BUF_PTB                     (0U)                    /*!< Primary transmit buffer. */
#define CAN_BUF_STB                     (1U)                    /*!< Secondary transmit buffer. */
/**
 * @}
 */

/**
 * @defgroup CAN_DLC CAN Data_Length_Code
 * @{
 */
#define CAN_DLC_0                       (0x0U)                    /*!< CAN2.0 and CAN FD: payload is 0 in bytes. */
#define CAN_DLC_1                       (0x1U)                    /*!< CAN2.0 and CAN FD: payload is 1 in bytes. */
#define CAN_DLC_2                       (0x2U)                    /*!< CAN2.0 and CAN FD: payload is 2 in bytes. */
#define CAN_DLC_3                       (0x3U)                    /*!< CAN2.0 and CAN FD: payload is 3 in bytes. */
#define CAN_DLC_4                       (0x4U)                    /*!< CAN2.0 and CAN FD: payload is 4 in bytes. */
#define CAN_DLC_5                       (0x5U)                    /*!< CAN2.0 and CAN FD: payload is 5 in bytes. */
#define CAN_DLC_6                       (0x6U)                    /*!< CAN2.0 and CAN FD: payload is 6 in bytes. */
#define CAN_DLC_7                       (0x7U)                    /*!< CAN2.0 and CAN FD: payload is 7 in bytes. */
#define CAN_DLC_8                       (0x8U)                    /*!< CAN2.0 and CAN FD: payload is 8 in bytes. */
#define CAN_DLC_12                      (0x9U)                    /*!< CAN FD: payload is 12 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_16                      (0xAU)                    /*!< CAN FD: payload is 16 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_20                      (0xBU)                    /*!< CAN FD: payload is 20 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_24                      (0xCU)                    /*!< CAN FD: payload is 24 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_32                      (0xDU)                    /*!< CAN FD: payload is 32 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_48                      (0xEU)                    /*!< CAN FD: payload is 48 in bytes. CAN2.0: payload is 8 in bytes. */
#define CAN_DLC_64                      (0xFU)                    /*!< CAN FD: payload is 64 in bytes. CAN2.0: payload is 8 in bytes. */
/**
 * @}
 */

/**
 * @defgroup CAN_Trans_Mode CAN Transmission Mode
 * @{
 */
#define CAN_TRANS_PTB_STB_AUTO_RETX     (0x0U)                  /*!< Both PTB and STB automatically retransmit. */
#define CAN_TRANS_PTB_SSHOT             (CAN_CFG_STAT_TPSS)     /*!< PTB single shot transmission mode. */
#define CAN_TRANS_STB_SSHOT             (CAN_CFG_STAT_TSSS)     /*!< STB single shot transmission mode. */
#define CAN_TRANS_PTB_STB_SSHOT         (CAN_CFG_STAT_TPSS | \
                                         CAN_CFG_STAT_TSSS)     /*!< STB single shot, PTB single shot. */
/**
 * @}
 */

/**
 * @defgroup CAN_STB_Trans_Control CAN STB Transmission Control
 * @{
 */
#define CAN_STB_TRANS_ALL               (0U)                    /*!< Transmit all of STB slots. */
#define CAN_STB_TRANS_ONE               (1U)                    /*!< Transmit one STB slot. */
/**
 * @}
 */

/**
 * @defgroup CAN_STB_Priority_Mode CAN STB Priority Mode
 * @{
 */
#define CAN_STB_PRIO_FIFO               (0x0U)                  /*!< Data first in and first be transmitted. */
#define CAN_STB_PRIO_ID                 (CAN_TCTRL_TSMODE)      /*!< Data with smallest ID first be transmitted. */
/**
 * @}
 */

/**
 * @defgroup CAN_TB_Status CAN Transmit Buffer Status
 * @{
 */
#define CAN_TB_STAT_EMPTY               (0x0U)                  /*!< TTCAN is disabled(TTEN == 0): STB is empty. \
                                                                     TTCAN is disabled(TTEN == 1) and transmit buffer is specified by TBPTR and TTPTR(TTTBM == 1): \
                                                                     PTB and STB are both empty. */
#define CAN_TB_STAT_LESS_HALF           (0x1U)                  /*!< TTEN == 0: STB is not less than half full; \
                                                                     TTEN == 1 && TTTBM == 1: PTB and STB are neither empty. */
#define CAN_TB_STAT_MORE_HALF           (0x2U)                  /*!< TTEN == 0: STB is more than half full; \
                                                                     TTEN == 1 && TTTBM == 1: reserved value. */
#define CAN_TB_STAT_FULL                (0x3U)                  /*!< TTEN == 0: STB is full; \
                                                                     TTEN == 1 && TTTBM == 1: PTB and STB are both full. */
/**
 * @}
 */

/**
 * @defgroup CAN_RB_Status CAN Receive Buffer Status
 * @{
 */
#define CAN_RB_STAT_EMPTY               (0x0U)                  /*!< Receive buffer(RB) is empty. */
#define CAN_RB_STAT_LESS_WARN_LIMIT     (0x1U)                  /*!< RB is not empty, but is less than almost full warning limit. */
#define CAN_RB_STAT_MORE_WARN_LIMIT     (0x2U)                  /*!< RB is not full, but is more than or equal to almost full warning limit. */
#define CAN_RB_STAT_FULL                (0x3U)                  /*!< RB is full. */
/**
 * @}
 */

/**
 * @defgroup CAN_FD_Mode CAN FD Mode
 * @{
 */
#define CAN_FD_MODE_BOSCH               (0x0U)
#define CAN_FD_MODE_ISO_11898           (CAN_TCTRL_FD_ISO)
/**
 * @}
 */

/**
 * @defgroup CAN_RB_Store_Selection CAN Receive Buffer Store Selection
 * @{
 */
#define CAN_RB_STORE_CORRECT_DATA       (0x0U)                  /*!< Receive buffer stores correct data frames only. */
#define CAN_RB_STORE_ALL_DATA           (CAN_RCTRL_RBALL)       /*!< Receive buffer stores all data frames, includes error data. */
/**
 * @}
 */

/**
 * @defgroup CAN_RB_Overflow_Operation CAN Receive Buffer Overflow Operation
 * @{
 */
#define CAN_RB_OVF_SAVE_NEW             (0x0U)                  /*!< Saves the newly received data and the first received data will be overwritten. */
#define CAN_RB_OVF_DISCARD_NEW          (CAN_RCTRL_ROM)         /*!< Discard the newly received data. */
/**
 * @}
 */

/**
 * @defgroup CAN_Self_ACK_Command CAN Self ACK Command
 * @{
 */
#define CAN_SELF_ACK_DISABLE            (0x0U)
#define CAN_SELF_ACK_ENABLE             (CAN_RCTRL_SACK)
/**
 * @}
 */

/**
 * @defgroup CAN_FD_TDC_Command CAN-FD Transmiter Delay Compensation Command
 * @{
 */
#define CAN_FD_TDC_DISABLE              (0x0U)
#define CAN_FD_TDC_ENABLE               (CAN_TDC_TDCEN)
/**
 * @}
 */

/**
 * @defgroup CAN_Interrupt_Type CAN Interrupt Type
 * @{
 */
#define CAN_INT_ERR_INT                 (1UL << 1U)             /*!< Register bit RTIE.EIE. Error interrupt. */
#define CAN_INT_STB_TRANS_OK            (1UL << 2U)             /*!< Register bit RTIE.TSIE. Secondary transmit buffer was transmitted successfully. */
#define CAN_INT_PTB_TRANS_OK            (1UL << 3U)             /*!< Register bit RTIE.TPIE. Primary transmit buffer was transmitted successfully. */
#define CAN_INT_RB_ALMOST_FULL          (1UL << 4U)             /*!< Register bit RTIE.RAFIE. The number of filled RB slot is greater than or equal to the LIMIT.AFWL setting value. */
#define CAN_INT_RB_FIFO_FULL            (1UL << 5U)             /*!< Register bit RTIE.RFIE. The FIFO of receive buffer is full. */
#define CAN_INT_RX_OVERRUN              (1UL << 6U)             /*!< Register bit RTIE.ROIE. Receive buffers are full and there is a further message to be stored. */
#define CAN_INT_RX                      (1UL << 7U)             /*!< Register bit RTIE.RIE. Received a valid data frame or remote frame. */
#define CAN_INT_BUS_ERR                 (1UL << 9U)             /*!< Register bit ERRINT.BEIE. Arbitration lost caused bus error */
#define CAN_INT_ARB_LOST                (1UL << 11U)            /*!< Register bit ERRINT.ALIE. Arbitration lost. */
#define CAN_INT_ERR_PASSIVE             (1UL << 13U)            /*!< Register bit ERRINT.EPIE. A change from error-passive to error-active or error-active to error-passive has occurred. */

