RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_can.h
#define CAN_INT_ALL                     (CAN_INT_ERR_INT        | \
                                         CAN_INT_STB_TRANS_OK   | \
                                         CAN_INT_PTB_TRANS_OK   | \
                                         CAN_INT_RB_ALMOST_FULL | \
                                         CAN_INT_RB_FIFO_FULL   | \
                                         CAN_INT_RX_OVERRUN     | \
                                         CAN_INT_RX             | \
                                         CAN_INT_BUS_ERR        | \
                                         CAN_INT_ARB_LOST       | \
                                         CAN_INT_ERR_PASSIVE)
/**
 * @}
 */

/**
 * @defgroup CAN_Common_Status_Flag CAN Common Status Flag
 * @{
 */
#define CAN_FLAG_BUS_OFF                (1UL << 0U)             /*!< Register bit CFG_STAT.BUSOFF. CAN bus off. */
#define CAN_FLAG_BUS_TX                 (1UL << 1U)             /*!< Register bit CFG_STAT.TACTIVE. CAN bus is transmitting. */
#define CAN_FLAG_BUS_RX                 (1UL << 2U)             /*!< Register bit CFG_STAT.RACTIVE. CAN bus is receiving. */
#define CAN_FLAG_RB_OVF                 (1UL << 5U)             /*!< Register bit RCTRL.ROV. Receive buffer is full and there is a further bit to be stored. At least one data is lost. */
#define CAN_FLAG_TB_FULL                (1UL << 8U)             /*!< Register bit RTIE.TSFF. Transmit buffers are all full. \
                                                                     TTCFG.TTEN == 0 or TCTRL.TTTEM == 0: ALL STB slots are filled. \
                                                                     TTCFG.TTEN == 1 and TCTRL.TTTEM == 1: Transmit buffer that pointed by TBSLOT.TBPTR is filled.*/
#define CAN_FLAG_TRANS_ABORTED          (1UL << 16U)            /*!< Register bit RTIF.AIF. Transmit messages requested via TCMD.TPA and TCMD.TSA were successfully canceled. */
#define CAN_FLAG_ERR_INT                (1UL << 17U)            /*!< Register bit RTIF.EIF. The CFG_STAT.BUSOFF bit changes, or the relative relationship between the value of the error counter and the \
                                                                     set value of the ERROR warning limit changes. For example, the value of the error counter changes from less than \
                                                                     the set value to greater than the set value, or from greater than the set value to less than the set value. */
#define CAN_FLAG_STB_TRANS_OK           (1UL << 18U)            /*!< Register bit RTIF.TSIF. STB was transmitted successfully. */
#define CAN_FLAG_PTB_TRANS_OK           (1UL << 19U)            /*!< Register bit RTIF.TPIF. PTB was transmitted successfully. */
#define CAN_FLAG_RB_ALMOST_FULL         (1UL << 20U)            /*!< Register bit RTIF.RAFIF. The number of filled RB slot is greater than or equal to the LIMIT.AFWL setting value. */
#define CAN_FLAG_RB_FIFO_FULL           (1UL << 21U)            /*!< Register bit RTIF.RFIF. The FIFO of receive buffer is full. */
#define CAN_FLAG_RX_OVERRUN             (1UL << 22U)            /*!< Register bit RTIF.ROIF. Receive buffers are all full and there is a further message to be stored. */
#define CAN_FLAG_RX_OK                  (1UL << 23U)            /*!< Register bit RTIF.RIF. Received a valid data frame or remote frame. */
#define CAN_FLAG_BUS_ERR                (1UL << 24U)            /*!< Register bit ERRINT.BEIF. Arbitration lost caused bus error. */
#define CAN_FLAG_ARB_LOST               (1UL << 26U)            /*!< Register bit ERRINT.ALIF. Arbitration lost. */
#define CAN_FLAG_ERR_PASSIVE            (1UL << 28U)            /*!< Register bit ERRINT.EPIF. A change from error-passive to error-active or error-active to error-passive has occurred. */
#define CAN_FLAG_ERR_PASSIVE_NODE       (1UL << 30U)            /*!< Register bit ERRINT.EPASS. The node is an error-passive node. */
#define CAN_FLAG_REACH_WARN_LIMIT       (1UL << 31U)            /*!< Register bit ERRINT.EWARN. REC or TEC is greater than or equal to the LIMIT.EWL setting value. */

#define CAN_FLAG_ALL                    (CAN_FLAG_BUS_OFF          | \
                                         CAN_FLAG_BUS_TX           | \
                                         CAN_FLAG_BUS_RX           | \
                                         CAN_FLAG_RB_OVF           | \
                                         CAN_FLAG_TB_FULL          | \
                                         CAN_FLAG_TRANS_ABORTED    | \
                                         CAN_FLAG_ERR_INT          | \
                                         CAN_FLAG_STB_TRANS_OK     | \
                                         CAN_FLAG_PTB_TRANS_OK     | \
                                         CAN_FLAG_RB_ALMOST_FULL   | \
                                         CAN_FLAG_RB_FIFO_FULL     | \
                                         CAN_FLAG_RX_OVERRUN       | \
                                         CAN_FLAG_RX_OK            | \
                                         CAN_FLAG_BUS_ERR          | \
                                         CAN_FLAG_ARB_LOST         | \
                                         CAN_FLAG_ERR_PASSIVE      | \
                                         CAN_FLAG_ERR_PASSIVE_NODE | \
                                         CAN_FLAG_REACH_WARN_LIMIT)

#define CAN_FLAG_CLR_MSK                (CAN_FLAG_RB_OVF           | \
                                         CAN_FLAG_TRANS_ABORTED    | \
                                         CAN_FLAG_ERR_INT          | \
                                         CAN_FLAG_STB_TRANS_OK     | \
                                         CAN_FLAG_PTB_TRANS_OK     | \
                                         CAN_FLAG_RB_ALMOST_FULL   | \
                                         CAN_FLAG_RB_FIFO_FULL     | \
                                         CAN_FLAG_RX_OVERRUN       | \
                                         CAN_FLAG_RX_OK            | \
                                         CAN_FLAG_BUS_ERR          | \
                                         CAN_FLAG_ARB_LOST         | \
                                         CAN_FLAG_ERR_PASSIVE      | \
                                         CAN_FLAG_ERR_PASSIVE_NODE | \
                                         CAN_FLAG_REACH_WARN_LIMIT)

#define CAN_FLAG_TX_ERR_MSK             (CAN_FLAG_BUS_OFF          | \
                                         CAN_FLAG_TB_FULL          | \
                                         CAN_FLAG_ERR_INT          | \
                                         CAN_FLAG_BUS_ERR          | \
                                         CAN_FLAG_ARB_LOST         | \
                                         CAN_FLAG_ERR_PASSIVE      | \
                                         CAN_FLAG_ERR_PASSIVE_NODE | \
                                         CAN_FLAG_REACH_WARN_LIMIT)

/**
 * @}
 */

/**
 * @defgroup CAN_AF_Mask_Type CAN AF Mask Type
 * @{
 */
#define CAN_AF_MSK_STD_EXT              (0x0U)                  /*!< Acceptance filter accept standard ID mask and extended ID mask. */
#define CAN_AF_MSK_STD                  (CAN_ACF_AIDEE)         /*!< Acceptance filter accept standard ID mask. */
#define CAN_AF_MSK_EXT                  (CAN_ACF_AIDEE | \
                                         CAN_ACF_AIDE)          /*!< Acceptance filter accept extended ID mask. */
/**
 * @}
 */

/**
 * @defgroup CAN_Error_Type CAN Error Type
 * @{
 */
#define CAN_ERR_NO                      (0U)                    /*!< No error. */
#define CAN_ERR_BIT                     (CAN_EALCAP_KOER_0)     /*!< Error is bit error. */
#define CAN_ERR_FORM                    (CAN_EALCAP_KOER_1)     /*!< Error is form error. */
#define CAN_ERR_STUFF                   (CAN_EALCAP_KOER_1 | \
                                         CAN_EALCAP_KOER_0)     /*!< Error is stuff error. */
#define CAN_ERR_ACK                     (CAN_EALCAP_KOER_2)     /*!< Error is ACK error. */
#define CAN_ERR_CRC                     (CAN_EALCAP_KOER_2 | \
                                         CAN_EALCAP_KOER_0)     /*!< Error is CRC error. */
#define CAN_ERR_OTHER                   (CAN_EALCAP_KOER_2 | \
                                         CAN_EALCAP_KOER_1)     /*!< Error is other error. */
/**
 * @}
 */

/**
 * @defgroup CAN_AF CAN Acceptance Filter
 * @{
 */
#define CAN_AF1                         (CAN_ACFEN_AE_1)        /*!< Acceptance filter 1 select bit. */
#define CAN_AF2                         (CAN_ACFEN_AE_2)        /*!< Acceptance filter 2 select bit. */
#define CAN_AF3                         (CAN_ACFEN_AE_3)        /*!< Acceptance filter 3 select bit. */
#define CAN_AF4                         (CAN_ACFEN_AE_4)        /*!< Acceptance filter 4 select bit. */
#define CAN_AF5                         (CAN_ACFEN_AE_5)        /*!< Acceptance filter 5 select bit. */
#define CAN_AF6                         (CAN_ACFEN_AE_6)        /*!< Acceptance filter 6 select bit. */
#define CAN_AF7                         (CAN_ACFEN_AE_7)        /*!< Acceptance filter 7 select bit. */
#define CAN_AF8                         (CAN_ACFEN_AE_8)        /*!< Acceptance filter 8 select bit. */
#define CAN_AF9                         (CAN_ACFEN_AE_9)        /*!< Acceptance filter 9 select bit. */
#define CAN_AF10                        (CAN_ACFEN_AE_10)       /*!< Acceptance filter 10 select bit. */
#define CAN_AF11                        (CAN_ACFEN_AE_11)       /*!< Acceptance filter 11 select bit. */
#define CAN_AF12                        (CAN_ACFEN_AE_12)       /*!< Acceptance filter 12 select bit. */
#define CAN_AF13                        (CAN_ACFEN_AE_13)       /*!< Acceptance filter 13 select bit. */
#define CAN_AF14                        (CAN_ACFEN_AE_14)       /*!< Acceptance filter 14 select bit. */
#define CAN_AF15                        (CAN_ACFEN_AE_15)       /*!< Acceptance filter 15 select bit. */
#define CAN_AF16                        (CAN_ACFEN_AE_16)       /*!< Acceptance filter 16 select bit. */
#define CAN_AF_ALL                      (0xFFFFU)
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_Transmit_Buffer_Mode CAN Time-triggered Communication Transmit Buffer Mode
 * @{
 */
#define CAN_TTC_TB_MODE_NORMAL          (0x0U)                      /*!< TTC transmit buffer depends on the priority of STB which is defined by @ref CAN_STB_Priority_Mode */
#define CAN_TTC_TB_MODE_PTR             (CAN_TCTRL_TTTBM)           /*!< TTC transmit buffer is pointed by TBSLOT.TBPTR(for data filling) and \
                                                                         TRG_CFG.TTPTR(for data transmission). */
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_TBS_Pointer CAN Time-triggered Communication Transmit Buffer Slot Pointer
 * @{
 */
#define CAN_TTC_TBS_PTB                 (0x0U)                      /*!< Point to PTB. */
#define CAN_TTC_TBS_STB1                (0x1U)                      /*!< Point to STB slot 1. */
#define CAN_TTC_TBS_STB2                (0x2U)                      /*!< Point to STB slot 2. */
#define CAN_TTC_TBS_STB3                (0x3U)                      /*!< Point to STB slot 3. */
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_Status_Flag CAN Time-triggered Communication Status Flag
 * @{
 */
#define CAN_TTC_FLAG_TTI                (CAN_TTCFG_TTIF)            /*!< Time trigger interrupt flag. */
#define CAN_TTC_FLAG_TEI                (CAN_TTCFG_TEIF)            /*!< Trigger error interrupt flag. */
#define CAN_TTC_FLAG_WTI                (CAN_TTCFG_WTIF)            /*!< Watch trigger interrupt flag. */

#define CAN_TTC_FLAG_ALL                (CAN_TTC_FLAG_TTI | \
                                         CAN_TTC_FLAG_TEI | \
                                         CAN_TTC_FLAG_WTI)
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_Interrupt_Type CAN Time-triggered Communication Interrupt Type
 * @{
 */
#define CAN_TTC_INT_TTI                 (CAN_TTCFG_TTIE)            /*!< Time trigger interrupt. */
#define CAN_TTC_INT_WTI                 (CAN_TTCFG_WTIE)            /*!< Watch trigger interrupt. */
#define CAN_TTC_INT_ALL                 (CAN_TTC_INT_TTI | CAN_TTC_INT_WTI)
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_NTU_Prescaler CAN Time-triggered Communication Network Time Unit Prescaler
 * @{
 */
#define CAN_TTC_NTU_PRESC_1             (0x0U)                      /*!< NTU is SBT bit time * 1. */
#define CAN_TTC_NTU_PRESC_2             (CAN_TTCFG_T_PRESC_0)       /*!< NTU is SBT bit time * 2. */
#define CAN_TTC_NTU_PRESC_4             (CAN_TTCFG_T_PRESC_1)       /*!< NTU is SBT bit time * 4. */
#define CAN_TTC_NTU_PRESC_8             (CAN_TTCFG_T_PRESC_1 | \
                                         CAN_TTCFG_T_PRESC_0)       /*!< NTU is SBT bit time * 8. */
/**
 * @}
 */

/**
 * @defgroup CAN_TTC_Trigger_Type CAN Time-triggered Communication Trigger Type
 * @{
 */
#define CAN_TTC_TRIG_IMMED_TRIG         (0x0U)                      /*!< Immediate trigger for immediate transmission. */
#define CAN_TTC_TRIG_TIME_TRIG          (CAN_TRG_CFG_TTYPE_0)       /*!< Time trigger for receive triggers. */
#define CAN_TTC_TRIG_SSHOT_TRANS_TRIG   (CAN_TRG_CFG_TTYPE_1)       /*!< Single shot transmit trigger for exclusive time windows. */
#define CAN_TTC_TRIG_TRANS_START_TRIG   (CAN_TRG_CFG_TTYPE_1 | \
                                         CAN_TRG_CFG_TTYPE_0)       /*!< Transmit start trigger for merged arbitrating time windows. */
#define CAN_TTC_TRIG_TRANS_STOP_TRIG    (CAN_TRG_CFG_TTYPE_2)       /*!< Transmit stop trigger for merged arbitrating time windows. */
/**
 * @}
 */

/**
 * @}
 */

