RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_can.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup CAN_Global_Functions
 * @{
 */
     en_result_t CAN_Init(M4_CAN_TypeDef *CANx, const stc_can_init_t *pstcInit);
     en_result_t CAN_StructInit(stc_can_init_t *pstcInit);
            void CAN_DeInit(M4_CAN_TypeDef *CANx);

            void CAN_SWReset(M4_CAN_TypeDef *CANx);
            void CAN_EnterNormalComm(M4_CAN_TypeDef *CANx);

            void CAN_SetWorkMode(M4_CAN_TypeDef *CANx, uint8_t u8WorkMode);
            void CAN_SetTransMode(M4_CAN_TypeDef *CANx, uint8_t u8TransMode);
            void CAN_SetSTBPrioMode(M4_CAN_TypeDef *CANx, uint8_t u8STBPrioMode);
            void CAN_SetRBStoreSel(M4_CAN_TypeDef *CANx, uint8_t u8RBStoreSel);
            void CAN_SetRBOvfOp(M4_CAN_TypeDef *CANx, uint8_t u8RBOvfOperation);

            void CAN_IntCmd(M4_CAN_TypeDef *CANx, uint32_t u32IntType, en_functional_state_t enNewState);
     en_result_t CAN_SBTConfig(M4_CAN_TypeDef *CANx, const stc_can_bt_cfg_t *pstcCfg);
         uint8_t CAN_GetArbLostPos(const M4_CAN_TypeDef *CANx);
         uint8_t CAN_GetErrType(const M4_CAN_TypeDef *CANx);
            void CAN_SetRBSWarnLimit(M4_CAN_TypeDef *CANx, uint8_t u8RBSWarnLimit);
            void CAN_SetErrWarnLimit(M4_CAN_TypeDef *CANx, uint8_t u8ErrWarnLimit);
         uint8_t CAN_GetREC(const M4_CAN_TypeDef *CANx);
         uint8_t CAN_GetTEC(const M4_CAN_TypeDef *CANx);
            void CAN_ClrErrCount(M4_CAN_TypeDef *CANx);
     en_result_t CAN_AFConfig(M4_CAN_TypeDef *CANx, uint16_t u16AFSel, const stc_can_af_cfg_t pstcAFCfg[]);
            void CAN_AFCmd(M4_CAN_TypeDef *CANx, uint16_t u16AFSel, en_functional_state_t enNewState);

         uint8_t CAN_GetTBType(const M4_CAN_TypeDef *CANx);
            void CAN_AbortTrans(M4_CAN_TypeDef *CANx, uint8_t u8TBType);

en_flag_status_t CAN_GetStatus(const M4_CAN_TypeDef *CANx, uint32_t u32Flag);
            void CAN_ClrStatus(M4_CAN_TypeDef *CANx, uint32_t u32Flag);
        uint32_t CAN_GetStatusVal(const M4_CAN_TypeDef *CANx);
         uint8_t CAN_GetTBFullStatus(const M4_CAN_TypeDef *CANx);
         uint8_t CAN_GetRBFullStatus(const M4_CAN_TypeDef *CANx);

     en_result_t CAN_FD_Config(M4_CAN_TypeDef *CANx, const stc_can_fd_cfg_t *pstcCfg);
     en_result_t CAN_FD_StructInit(stc_can_fd_cfg_t *pstcCfg);
            void CAN_FD_Cmd(const M4_CAN_TypeDef *CANx, en_functional_state_t enNewState);

     en_result_t CAN_TTC_StructInit(stc_can_ttc_cfg_t *pstcCfg);
     en_result_t CAN_TTC_Config(M4_CAN_TypeDef *CANx, const stc_can_ttc_cfg_t *pstcCfg);
            void CAN_TTC_Cmd(M4_CAN_TypeDef *CANx, en_functional_state_t enNewState);

            void CAN_TTC_SetTBSToBeFilled(M4_CAN_TypeDef *CANx, uint8_t u8SlotPtr);
            void CAN_TTC_SetTBSFilled(M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetNTUPrescaler(M4_CAN_TypeDef *CANx, uint8_t u8NTUPrescaler);
            void CAN_TTC_IntCmd(M4_CAN_TypeDef *CANx, uint8_t u8IntType, en_functional_state_t enNewState);
en_flag_status_t CAN_TTC_GetStatus(const M4_CAN_TypeDef *CANx, uint8_t u8Flag);
            void CAN_TTC_ClrStatus(M4_CAN_TypeDef *CANx, uint8_t u8Flag);
         uint8_t CAN_TTC_GetStatusVal(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetRefMsgID(M4_CAN_TypeDef *CANx, uint32_t u32ID);
            void CAN_TTC_SetRefMsgIDE(M4_CAN_TypeDef *CANx, uint32_t u32IDE);
        uint32_t CAN_TTC_GetRefMsgID(const M4_CAN_TypeDef *CANx);
        uint32_t CAN_TTC_GetRefMsgIDE(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetTxTrigTBS(M4_CAN_TypeDef *CANx, uint8_t u8TBSlotPtr);
         uint8_t CAN_TTC_GetTxTrigTBS(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetTrigType(M4_CAN_TypeDef *CANx, uint16_t u16TrigType);
        uint16_t CAN_TTC_GetTrigType(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetTxEnableWindow(M4_CAN_TypeDef *CANx, uint16_t u16TxEnableWindow);
        uint16_t CAN_TTC_GetTxEnableWindow(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetTxTrigTime(M4_CAN_TypeDef *CANx, uint16_t u16TxTrigTime);
        uint16_t CAN_TTC_GetTxTrigTime(const M4_CAN_TypeDef *CANx);
            void CAN_TTC_SetWatchTrigTime(M4_CAN_TypeDef *CANx, uint16_t u16WatchTrigTime);
        uint16_t CAN_TTC_GetWatchTrigTime(const M4_CAN_TypeDef *CANx);

     en_result_t CAN_TransData(M4_CAN_TypeDef *CANx, const stc_can_tx_t *pstcTx,
                               uint8_t u8TxBufType, uint8_t u8STBTxCtrl, uint32_t u32Timeout);
     en_result_t CAN_TTC_TransData(M4_CAN_TypeDef *CANx, const stc_can_tx_t *pstcTx, uint8_t u8TBSlot);

     en_result_t CAN_ReceiveData(M4_CAN_TypeDef *CANx, stc_can_rx_t *pstcRx, uint8_t *pu8RxFrameCnt, uint8_t u8RxFrameBufLength);

/**
 * @}
 */

#endif /* DDL_CAN_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_CAN_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
